GopalSaraf/Practicals/PSDL/include/proc/pic16lf1579.inc
// Register: PWM1OFCON
#define PWM1OFCON PWM1OFCON
PWM1OFCON                                equ 0DA0h
// bitfield definitions
PWM1OFCON_OFS_POSN                       equ 0000h
PWM1OFCON_OFS_POSITION                   equ 0000h
PWM1OFCON_OFS_SIZE                       equ 0002h
PWM1OFCON_OFS_LENGTH                     equ 0002h
PWM1OFCON_OFS_MASK                       equ 0003h
PWM1OFCON_OFO_POSN                       equ 0004h
PWM1OFCON_OFO_POSITION                   equ 0004h
PWM1OFCON_OFO_SIZE                       equ 0001h
PWM1OFCON_OFO_LENGTH                     equ 0001h
PWM1OFCON_OFO_MASK                       equ 0010h
PWM1OFCON_OFM_POSN                       equ 0005h
PWM1OFCON_OFM_POSITION                   equ 0005h
PWM1OFCON_OFM_SIZE                       equ 0002h
PWM1OFCON_OFM_LENGTH                     equ 0002h
PWM1OFCON_OFM_MASK                       equ 0060h
PWM1OFCON_PWM1OFS0_POSN                  equ 0000h
PWM1OFCON_PWM1OFS0_POSITION              equ 0000h
PWM1OFCON_PWM1OFS0_SIZE                  equ 0001h
PWM1OFCON_PWM1OFS0_LENGTH                equ 0001h
PWM1OFCON_PWM1OFS0_MASK                  equ 0001h
PWM1OFCON_PWM1OFS1_POSN                  equ 0001h
PWM1OFCON_PWM1OFS1_POSITION              equ 0001h
PWM1OFCON_PWM1OFS1_SIZE                  equ 0001h
PWM1OFCON_PWM1OFS1_LENGTH                equ 0001h
PWM1OFCON_PWM1OFS1_MASK                  equ 0002h
PWM1OFCON_PWM1OFM0_POSN                  equ 0005h
PWM1OFCON_PWM1OFM0_POSITION              equ 0005h
PWM1OFCON_PWM1OFM0_SIZE                  equ 0001h
PWM1OFCON_PWM1OFM0_LENGTH                equ 0001h
PWM1OFCON_PWM1OFM0_MASK                  equ 0020h
PWM1OFCON_PWM1OFM1_POSN                  equ 0006h
PWM1OFCON_PWM1OFM1_POSITION              equ 0006h
PWM1OFCON_PWM1OFM1_SIZE                  equ 0001h
PWM1OFCON_PWM1OFM1_LENGTH                equ 0001h
PWM1OFCON_PWM1OFM1_MASK                  equ 0040h
PWM1OFCON_PWM1OFS_POSN                   equ 0000h
PWM1OFCON_PWM1OFS_POSITION               equ 0000h
PWM1OFCON_PWM1OFS_SIZE                   equ 0002h
PWM1OFCON_PWM1OFS_LENGTH                 equ 0002h
PWM1OFCON_PWM1OFS_MASK                   equ 0003h
PWM1OFCON_PWM1OFMC_POSN                  equ 0004h
PWM1OFCON_PWM1OFMC_POSITION              equ 0004h
PWM1OFCON_PWM1OFMC_SIZE                  equ 0001h
PWM1OFCON_PWM1OFMC_LENGTH                equ 0001h
PWM1OFCON_PWM1OFMC_MASK                  equ 0010h
PWM1OFCON_PWM1OFM_POSN                   equ 0005h
PWM1OFCON_PWM1OFM_POSITION               equ 0005h
PWM1OFCON_PWM1OFM_SIZE                   equ 0002h
PWM1OFCON_PWM1OFM_LENGTH                 equ 0002h
PWM1OFCON_PWM1OFM_MASK                   equ 0060h
PWM1OFCON_OFS0_POSN                      equ 0000h
PWM1OFCON_OFS0_POSITION                  equ 0000h
PWM1OFCON_OFS0_SIZE                      equ 0001h
PWM1OFCON_OFS0_LENGTH                    equ 0001h
PWM1OFCON_OFS0_MASK                      equ 0001h
PWM1OFCON_OFS1_POSN                      equ 0001h
PWM1OFCON_OFS1_POSITION                  equ 0001h
PWM1OFCON_OFS1_SIZE                      equ 0001h
PWM1OFCON_OFS1_LENGTH                    equ 0001h
PWM1OFCON_OFS1_MASK                      equ 0002h
PWM1OFCON_OFM0_POSN                      equ 0005h
PWM1OFCON_OFM0_POSITION                  equ 0005h
PWM1OFCON_OFM0_SIZE                      equ 0001h
PWM1OFCON_OFM0_LENGTH                    equ 0001h
PWM1OFCON_OFM0_MASK                      equ 0020h
PWM1OFCON_OFM1_POSN                      equ 0006h
PWM1OFCON_OFM1_POSITION                  equ 0006h
PWM1OFCON_OFM1_SIZE                      equ 0001h
PWM1OFCON_OFM1_LENGTH                    equ 0001h
PWM1OFCON_OFM1_MASK                      equ 0040h

// Register: PWM2PHL
#define PWM2PHL PWM2PHL
PWM2PHL                                  equ 0DA1h
// bitfield definitions
PWM2PHL_PH_POSN                          equ 0000h
PWM2PHL_PH_POSITION                      equ 0000h
PWM2PHL_PH_SIZE                          equ 0008h
PWM2PHL_PH_LENGTH                        equ 0008h
PWM2PHL_PH_MASK                          equ 00FFh
PWM2PHL_PWM2PHL0_POSN                    equ 0000h
PWM2PHL_PWM2PHL0_POSITION                equ 0000h
PWM2PHL_PWM2PHL0_SIZE                    equ 0001h
PWM2PHL_PWM2PHL0_LENGTH                  equ 0001h
PWM2PHL_PWM2PHL0_MASK                    equ 0001h
PWM2PHL_PWM2PHL1_POSN                    equ 0001h
PWM2PHL_PWM2PHL1_POSITION                equ 0001h
PWM2PHL_PWM2PHL1_SIZE                    equ 0001h
PWM2PHL_PWM2PHL1_LENGTH                  equ 0001h
PWM2PHL_PWM2PHL1_MASK                    equ 0002h
PWM2PHL_PWM2PHL2_POSN                    equ 0002h
PWM2PHL_PWM2PHL2_POSITION                equ 0002h
PWM2PHL_PWM2PHL2_SIZE                    equ 0001h
PWM2PHL_PWM2PHL2_LENGTH                  equ 0001h
PWM2PHL_PWM2PHL2_MASK                    equ 0004h
PWM2PHL_PWM2PHL3_POSN                    equ 0003h
PWM2PHL_PWM2PHL3_POSITION                equ 0003h
PWM2PHL_PWM2PHL3_SIZE                    equ 0001h
PWM2PHL_PWM2PHL3_LENGTH                  equ 0001h
PWM2PHL_PWM2PHL3_MASK                    equ 0008h
PWM2PHL_PWM2PHL4_POSN                    equ 0004h
PWM2PHL_PWM2PHL4_POSITION                equ 0004h
PWM2PHL_PWM2PHL4_SIZE                    equ 0001h
PWM2PHL_PWM2PHL4_LENGTH                  equ 0001h
PWM2PHL_PWM2PHL4_MASK                    equ 0010h
PWM2PHL_PWM2PHL5_POSN                    equ 0005h
PWM2PHL_PWM2PHL5_POSITION                equ 0005h
PWM2PHL_PWM2PHL5_SIZE                    equ 0001h
PWM2PHL_PWM2PHL5_LENGTH                  equ 0001h
PWM2PHL_PWM2PHL5_MASK                    equ 0020h
PWM2PHL_PWM2PHL6_POSN                    equ 0006h
PWM2PHL_PWM2PHL6_POSITION                equ 0006h
PWM2PHL_PWM2PHL6_SIZE                    equ 0001h
PWM2PHL_PWM2PHL6_LENGTH                  equ 0001h
PWM2PHL_PWM2PHL6_MASK                    equ 0040h
PWM2PHL_PWM2PHL7_POSN                    equ 0007h
PWM2PHL_PWM2PHL7_POSITION                equ 0007h
PWM2PHL_PWM2PHL7_SIZE                    equ 0001h
PWM2PHL_PWM2PHL7_LENGTH                  equ 0001h
PWM2PHL_PWM2PHL7_MASK                    equ 0080h
PWM2PHL_PWM2PHL_POSN                     equ 0000h
PWM2PHL_PWM2PHL_POSITION                 equ 0000h
PWM2PHL_PWM2PHL_SIZE                     equ 0008h
PWM2PHL_PWM2PHL_LENGTH                   equ 0008h
PWM2PHL_PWM2PHL_MASK                     equ 00FFh

// Register: PWM2PHH
#define PWM2PHH PWM2PHH
PWM2PHH                                  equ 0DA2h
// bitfield definitions
PWM2PHH_PH_POSN                          equ 0000h
PWM2PHH_PH_POSITION                      equ 0000h
PWM2PHH_PH_SIZE                          equ 0008h
PWM2PHH_PH_LENGTH                        equ 0008h
PWM2PHH_PH_MASK                          equ 00FFh
PWM2PHH_PWM2PHH0_POSN                    equ 0000h
PWM2PHH_PWM2PHH0_POSITION                equ 0000h
PWM2PHH_PWM2PHH0_SIZE                    equ 0001h
PWM2PHH_PWM2PHH0_LENGTH                  equ 0001h
PWM2PHH_PWM2PHH0_MASK                    equ 0001h
PWM2PHH_PWM2PHH1_POSN                    equ 0001h
PWM2PHH_PWM2PHH1_POSITION                equ 0001h
PWM2PHH_PWM2PHH1_SIZE                    equ 0001h
PWM2PHH_PWM2PHH1_LENGTH                  equ 0001h
PWM2PHH_PWM2PHH1_MASK                    equ 0002h
PWM2PHH_PWM2PHH2_POSN                    equ 0002h
PWM2PHH_PWM2PHH2_POSITION                equ 0002h
PWM2PHH_PWM2PHH2_SIZE                    equ 0001h
PWM2PHH_PWM2PHH2_LENGTH                  equ 0001h
PWM2PHH_PWM2PHH2_MASK                    equ 0004h
PWM2PHH_PWM2PHH3_POSN                    equ 0003h
PWM2PHH_PWM2PHH3_POSITION                equ 0003h
PWM2PHH_PWM2PHH3_SIZE                    equ 0001h
PWM2PHH_PWM2PHH3_LENGTH                  equ 0001h
PWM2PHH_PWM2PHH3_MASK                    equ 0008h
PWM2PHH_PWM2PHH4_POSN                    equ 0004h
PWM2PHH_PWM2PHH4_POSITION                equ 0004h
PWM2PHH_PWM2PHH4_SIZE                    equ 0001h
PWM2PHH_PWM2PHH4_LENGTH                  equ 0001h
PWM2PHH_PWM2PHH4_MASK                    equ 0010h
PWM2PHH_PWM2PHH5_POSN                    equ 0005h
PWM2PHH_PWM2PHH5_POSITION                equ 0005h
PWM2PHH_PWM2PHH5_SIZE                    equ 0001h
PWM2PHH_PWM2PHH5_LENGTH                  equ 0001h
PWM2PHH_PWM2PHH5_MASK                    equ 0020h
PWM2PHH_PWM2PHH6_POSN                    equ 0006h
PWM2PHH_PWM2PHH6_POSITION                equ 0006h
PWM2PHH_PWM2PHH6_SIZE                    equ 0001h
PWM2PHH_PWM2PHH6_LENGTH                  equ 0001h
PWM2PHH_PWM2PHH6_MASK                    equ 0040h
PWM2PHH_PWM2PHH7_POSN                    equ 0007h
PWM2PHH_PWM2PHH7_POSITION                equ 0007h
PWM2PHH_PWM2PHH7_SIZE                    equ 0001h
PWM2PHH_PWM2PHH7_LENGTH                  equ 0001h
PWM2PHH_PWM2PHH7_MASK                    equ 0080h
PWM2PHH_PWM2PHH_POSN                     equ 0000h
PWM2PHH_PWM2PHH_POSITION                 equ 0000h
PWM2PHH_PWM2PHH_SIZE                     equ 0008h
PWM2PHH_PWM2PHH_LENGTH                   equ 0008h
PWM2PHH_PWM2PHH_MASK                     equ 00FFh

// Register: PWM2DCL
#define PWM2DCL PWM2DCL
PWM2DCL                                  equ 0DA3h
// bitfield definitions
PWM2DCL_DC_POSN                          equ 0000h
PWM2DCL_DC_POSITION                      equ 0000h
PWM2DCL_DC_SIZE                          equ 0008h
PWM2DCL_DC_LENGTH                        equ 0008h
PWM2DCL_DC_MASK                          equ 00FFh
PWM2DCL_PWM2DCL0_POSN                    equ 0000h
PWM2DCL_PWM2DCL0_POSITION                equ 0000h
PWM2DCL_PWM2DCL0_SIZE                    equ 0001h
PWM2DCL_PWM2DCL0_LENGTH                  equ 0001h
PWM2DCL_PWM2DCL0_MASK                    equ 0001h
PWM2DCL_PWM2DCL1_POSN                    equ 0001h
PWM2DCL_PWM2DCL1_POSITION                equ 0001h
PWM2DCL_PWM2DCL1_SIZE                    equ 0001h
PWM2DCL_PWM2DCL1_LENGTH                  equ 0001h
PWM2DCL_PWM2DCL1_MASK                    equ 0002h
PWM2DCL_PWM2DCL2_POSN                    equ 0002h
PWM2DCL_PWM2DCL2_POSITION                equ 0002h
PWM2DCL_PWM2DCL2_SIZE                    equ 0001h
PWM2DCL_PWM2DCL2_LENGTH                  equ 0001h
PWM2DCL_PWM2DCL2_MASK                    equ 0004h
PWM2DCL_PWM2DCL3_POSN                    equ 0003h
PWM2DCL_PWM2DCL3_POSITION                equ 0003h
PWM2DCL_PWM2DCL3_SIZE                    equ 0001h
PWM2DCL_PWM2DCL3_LENGTH                  equ 0001h
PWM2DCL_PWM2DCL3_MASK                    equ 0008h
PWM2DCL_PWM2DCL4_POSN                    equ 0004h
PWM2DCL_PWM2DCL4_POSITION                equ 0004h
PWM2DCL_PWM2DCL4_SIZE                    equ 0001h
PWM2DCL_PWM2DCL4_LENGTH                  equ 0001h
PWM2DCL_PWM2DCL4_MASK                    equ 0010h
PWM2DCL_PWM2DCL5_POSN                    equ 0005h
PWM2DCL_PWM2DCL5_POSITION                equ 0005h
PWM2DCL_PWM2DCL5_SIZE                    equ 0001h
PWM2DCL_PWM2DCL5_LENGTH                  equ 0001h
PWM2DCL_PWM2DCL5_MASK                    equ 0020h
PWM2DCL_PWM2DCL6_POSN                    equ 0006h
PWM2DCL_PWM2DCL6_POSITION                equ 0006h
PWM2DCL_PWM2DCL6_SIZE                    equ 0001h
PWM2DCL_PWM2DCL6_LENGTH                  equ 0001h
PWM2DCL_PWM2DCL6_MASK                    equ 0040h
PWM2DCL_PWM2DCL7_POSN                    equ 0007h
PWM2DCL_PWM2DCL7_POSITION                equ 0007h
PWM2DCL_PWM2DCL7_SIZE                    equ 0001h
PWM2DCL_PWM2DCL7_LENGTH                  equ 0001h
PWM2DCL_PWM2DCL7_MASK                    equ 0080h
PWM2DCL_PWM2DCL_POSN                     equ 0000h
PWM2DCL_PWM2DCL_POSITION                 equ 0000h
PWM2DCL_PWM2DCL_SIZE                     equ 0008h
PWM2DCL_PWM2DCL_LENGTH                   equ 0008h
PWM2DCL_PWM2DCL_MASK                     equ 00FFh

