GopalSaraf/Practicals/PSDL/include/proc/pic16lf1579.inc
// Register: PWM2DCH
#define PWM2DCH PWM2DCH
PWM2DCH                                  equ 0DA4h
// bitfield definitions
PWM2DCH_DC_POSN                          equ 0000h
PWM2DCH_DC_POSITION                      equ 0000h
PWM2DCH_DC_SIZE                          equ 0008h
PWM2DCH_DC_LENGTH                        equ 0008h
PWM2DCH_DC_MASK                          equ 00FFh
PWM2DCH_PWM2DCH0_POSN                    equ 0000h
PWM2DCH_PWM2DCH0_POSITION                equ 0000h
PWM2DCH_PWM2DCH0_SIZE                    equ 0001h
PWM2DCH_PWM2DCH0_LENGTH                  equ 0001h
PWM2DCH_PWM2DCH0_MASK                    equ 0001h
PWM2DCH_PWM2DCH1_POSN                    equ 0001h
PWM2DCH_PWM2DCH1_POSITION                equ 0001h
PWM2DCH_PWM2DCH1_SIZE                    equ 0001h
PWM2DCH_PWM2DCH1_LENGTH                  equ 0001h
PWM2DCH_PWM2DCH1_MASK                    equ 0002h
PWM2DCH_PWM2DCH2_POSN                    equ 0002h
PWM2DCH_PWM2DCH2_POSITION                equ 0002h
PWM2DCH_PWM2DCH2_SIZE                    equ 0001h
PWM2DCH_PWM2DCH2_LENGTH                  equ 0001h
PWM2DCH_PWM2DCH2_MASK                    equ 0004h
PWM2DCH_PWM2DCH3_POSN                    equ 0003h
PWM2DCH_PWM2DCH3_POSITION                equ 0003h
PWM2DCH_PWM2DCH3_SIZE                    equ 0001h
PWM2DCH_PWM2DCH3_LENGTH                  equ 0001h
PWM2DCH_PWM2DCH3_MASK                    equ 0008h
PWM2DCH_PWM2DCH4_POSN                    equ 0004h
PWM2DCH_PWM2DCH4_POSITION                equ 0004h
PWM2DCH_PWM2DCH4_SIZE                    equ 0001h
PWM2DCH_PWM2DCH4_LENGTH                  equ 0001h
PWM2DCH_PWM2DCH4_MASK                    equ 0010h
PWM2DCH_PWM2DCH5_POSN                    equ 0005h
PWM2DCH_PWM2DCH5_POSITION                equ 0005h
PWM2DCH_PWM2DCH5_SIZE                    equ 0001h
PWM2DCH_PWM2DCH5_LENGTH                  equ 0001h
PWM2DCH_PWM2DCH5_MASK                    equ 0020h
PWM2DCH_PWM2DCH6_POSN                    equ 0006h
PWM2DCH_PWM2DCH6_POSITION                equ 0006h
PWM2DCH_PWM2DCH6_SIZE                    equ 0001h
PWM2DCH_PWM2DCH6_LENGTH                  equ 0001h
PWM2DCH_PWM2DCH6_MASK                    equ 0040h
PWM2DCH_PWM2DCH7_POSN                    equ 0007h
PWM2DCH_PWM2DCH7_POSITION                equ 0007h
PWM2DCH_PWM2DCH7_SIZE                    equ 0001h
PWM2DCH_PWM2DCH7_LENGTH                  equ 0001h
PWM2DCH_PWM2DCH7_MASK                    equ 0080h
PWM2DCH_PWM2DCH_POSN                     equ 0000h
PWM2DCH_PWM2DCH_POSITION                 equ 0000h
PWM2DCH_PWM2DCH_SIZE                     equ 0008h
PWM2DCH_PWM2DCH_LENGTH                   equ 0008h
PWM2DCH_PWM2DCH_MASK                     equ 00FFh

// Register: PWM2PRL
#define PWM2PRL PWM2PRL
PWM2PRL                                  equ 0DA5h
// bitfield definitions
PWM2PRL_PR_POSN                          equ 0000h
PWM2PRL_PR_POSITION                      equ 0000h
PWM2PRL_PR_SIZE                          equ 0008h
PWM2PRL_PR_LENGTH                        equ 0008h
PWM2PRL_PR_MASK                          equ 00FFh
PWM2PRL_PWM2PRL0_POSN                    equ 0000h
PWM2PRL_PWM2PRL0_POSITION                equ 0000h
PWM2PRL_PWM2PRL0_SIZE                    equ 0001h
PWM2PRL_PWM2PRL0_LENGTH                  equ 0001h
PWM2PRL_PWM2PRL0_MASK                    equ 0001h
PWM2PRL_PWM2PRL1_POSN                    equ 0001h
PWM2PRL_PWM2PRL1_POSITION                equ 0001h
PWM2PRL_PWM2PRL1_SIZE                    equ 0001h
PWM2PRL_PWM2PRL1_LENGTH                  equ 0001h
PWM2PRL_PWM2PRL1_MASK                    equ 0002h
PWM2PRL_PWM2PRL2_POSN                    equ 0002h
PWM2PRL_PWM2PRL2_POSITION                equ 0002h
PWM2PRL_PWM2PRL2_SIZE                    equ 0001h
PWM2PRL_PWM2PRL2_LENGTH                  equ 0001h
PWM2PRL_PWM2PRL2_MASK                    equ 0004h
PWM2PRL_PWM2PRL3_POSN                    equ 0003h
PWM2PRL_PWM2PRL3_POSITION                equ 0003h
PWM2PRL_PWM2PRL3_SIZE                    equ 0001h
PWM2PRL_PWM2PRL3_LENGTH                  equ 0001h
PWM2PRL_PWM2PRL3_MASK                    equ 0008h
PWM2PRL_PWM2PRL4_POSN                    equ 0004h
PWM2PRL_PWM2PRL4_POSITION                equ 0004h
PWM2PRL_PWM2PRL4_SIZE                    equ 0001h
PWM2PRL_PWM2PRL4_LENGTH                  equ 0001h
PWM2PRL_PWM2PRL4_MASK                    equ 0010h
PWM2PRL_PWM2PRL5_POSN                    equ 0005h
PWM2PRL_PWM2PRL5_POSITION                equ 0005h
PWM2PRL_PWM2PRL5_SIZE                    equ 0001h
PWM2PRL_PWM2PRL5_LENGTH                  equ 0001h
PWM2PRL_PWM2PRL5_MASK                    equ 0020h
PWM2PRL_PWM2PRL6_POSN                    equ 0006h
PWM2PRL_PWM2PRL6_POSITION                equ 0006h
PWM2PRL_PWM2PRL6_SIZE                    equ 0001h
PWM2PRL_PWM2PRL6_LENGTH                  equ 0001h
PWM2PRL_PWM2PRL6_MASK                    equ 0040h
PWM2PRL_PWM2PRL7_POSN                    equ 0007h
PWM2PRL_PWM2PRL7_POSITION                equ 0007h
PWM2PRL_PWM2PRL7_SIZE                    equ 0001h
PWM2PRL_PWM2PRL7_LENGTH                  equ 0001h
PWM2PRL_PWM2PRL7_MASK                    equ 0080h
PWM2PRL_PWM2PRL_POSN                     equ 0000h
PWM2PRL_PWM2PRL_POSITION                 equ 0000h
PWM2PRL_PWM2PRL_SIZE                     equ 0008h
PWM2PRL_PWM2PRL_LENGTH                   equ 0008h
PWM2PRL_PWM2PRL_MASK                     equ 00FFh

// Register: PWM2PRH
#define PWM2PRH PWM2PRH
PWM2PRH                                  equ 0DA6h
// bitfield definitions
PWM2PRH_PR_POSN                          equ 0000h
PWM2PRH_PR_POSITION                      equ 0000h
PWM2PRH_PR_SIZE                          equ 0008h
PWM2PRH_PR_LENGTH                        equ 0008h
PWM2PRH_PR_MASK                          equ 00FFh
PWM2PRH_PWM2PRH0_POSN                    equ 0000h
PWM2PRH_PWM2PRH0_POSITION                equ 0000h
PWM2PRH_PWM2PRH0_SIZE                    equ 0001h
PWM2PRH_PWM2PRH0_LENGTH                  equ 0001h
PWM2PRH_PWM2PRH0_MASK                    equ 0001h
PWM2PRH_PWM2PRH1_POSN                    equ 0001h
PWM2PRH_PWM2PRH1_POSITION                equ 0001h
PWM2PRH_PWM2PRH1_SIZE                    equ 0001h
PWM2PRH_PWM2PRH1_LENGTH                  equ 0001h
PWM2PRH_PWM2PRH1_MASK                    equ 0002h
PWM2PRH_PWM2PRH2_POSN                    equ 0002h
PWM2PRH_PWM2PRH2_POSITION                equ 0002h
PWM2PRH_PWM2PRH2_SIZE                    equ 0001h
PWM2PRH_PWM2PRH2_LENGTH                  equ 0001h
PWM2PRH_PWM2PRH2_MASK                    equ 0004h
PWM2PRH_PWM2PRH3_POSN                    equ 0003h
PWM2PRH_PWM2PRH3_POSITION                equ 0003h
PWM2PRH_PWM2PRH3_SIZE                    equ 0001h
PWM2PRH_PWM2PRH3_LENGTH                  equ 0001h
PWM2PRH_PWM2PRH3_MASK                    equ 0008h
PWM2PRH_PWM2PRH4_POSN                    equ 0004h
PWM2PRH_PWM2PRH4_POSITION                equ 0004h
PWM2PRH_PWM2PRH4_SIZE                    equ 0001h
PWM2PRH_PWM2PRH4_LENGTH                  equ 0001h
PWM2PRH_PWM2PRH4_MASK                    equ 0010h
PWM2PRH_PWM2PRH5_POSN                    equ 0005h
PWM2PRH_PWM2PRH5_POSITION                equ 0005h
PWM2PRH_PWM2PRH5_SIZE                    equ 0001h
PWM2PRH_PWM2PRH5_LENGTH                  equ 0001h
PWM2PRH_PWM2PRH5_MASK                    equ 0020h
PWM2PRH_PWM2PRH6_POSN                    equ 0006h
PWM2PRH_PWM2PRH6_POSITION                equ 0006h
PWM2PRH_PWM2PRH6_SIZE                    equ 0001h
PWM2PRH_PWM2PRH6_LENGTH                  equ 0001h
PWM2PRH_PWM2PRH6_MASK                    equ 0040h
PWM2PRH_PWM2PRH7_POSN                    equ 0007h
PWM2PRH_PWM2PRH7_POSITION                equ 0007h
PWM2PRH_PWM2PRH7_SIZE                    equ 0001h
PWM2PRH_PWM2PRH7_LENGTH                  equ 0001h
PWM2PRH_PWM2PRH7_MASK                    equ 0080h
PWM2PRH_PWM2PRH_POSN                     equ 0000h
PWM2PRH_PWM2PRH_POSITION                 equ 0000h
PWM2PRH_PWM2PRH_SIZE                     equ 0008h
PWM2PRH_PWM2PRH_LENGTH                   equ 0008h
PWM2PRH_PWM2PRH_MASK                     equ 00FFh

// Register: PWM2OFL
#define PWM2OFL PWM2OFL
PWM2OFL                                  equ 0DA7h
// bitfield definitions
PWM2OFL_OF_POSN                          equ 0000h
PWM2OFL_OF_POSITION                      equ 0000h
PWM2OFL_OF_SIZE                          equ 0008h
PWM2OFL_OF_LENGTH                        equ 0008h
PWM2OFL_OF_MASK                          equ 00FFh
PWM2OFL_PWM2OFL0_POSN                    equ 0000h
PWM2OFL_PWM2OFL0_POSITION                equ 0000h
PWM2OFL_PWM2OFL0_SIZE                    equ 0001h
PWM2OFL_PWM2OFL0_LENGTH                  equ 0001h
PWM2OFL_PWM2OFL0_MASK                    equ 0001h
PWM2OFL_PWM2OFL1_POSN                    equ 0001h
PWM2OFL_PWM2OFL1_POSITION                equ 0001h
PWM2OFL_PWM2OFL1_SIZE                    equ 0001h
PWM2OFL_PWM2OFL1_LENGTH                  equ 0001h
PWM2OFL_PWM2OFL1_MASK                    equ 0002h
PWM2OFL_PWM2OFL2_POSN                    equ 0002h
PWM2OFL_PWM2OFL2_POSITION                equ 0002h
PWM2OFL_PWM2OFL2_SIZE                    equ 0001h
PWM2OFL_PWM2OFL2_LENGTH                  equ 0001h
PWM2OFL_PWM2OFL2_MASK                    equ 0004h
PWM2OFL_PWM2OFL3_POSN                    equ 0003h
PWM2OFL_PWM2OFL3_POSITION                equ 0003h
PWM2OFL_PWM2OFL3_SIZE                    equ 0001h
PWM2OFL_PWM2OFL3_LENGTH                  equ 0001h
PWM2OFL_PWM2OFL3_MASK                    equ 0008h
PWM2OFL_PWM2OFL4_POSN                    equ 0004h
PWM2OFL_PWM2OFL4_POSITION                equ 0004h
PWM2OFL_PWM2OFL4_SIZE                    equ 0001h
PWM2OFL_PWM2OFL4_LENGTH                  equ 0001h
PWM2OFL_PWM2OFL4_MASK                    equ 0010h
PWM2OFL_PWM2OFL5_POSN                    equ 0005h
PWM2OFL_PWM2OFL5_POSITION                equ 0005h
PWM2OFL_PWM2OFL5_SIZE                    equ 0001h
PWM2OFL_PWM2OFL5_LENGTH                  equ 0001h
PWM2OFL_PWM2OFL5_MASK                    equ 0020h
PWM2OFL_PWM2OFL6_POSN                    equ 0006h
PWM2OFL_PWM2OFL6_POSITION                equ 0006h
PWM2OFL_PWM2OFL6_SIZE                    equ 0001h
PWM2OFL_PWM2OFL6_LENGTH                  equ 0001h
PWM2OFL_PWM2OFL6_MASK                    equ 0040h
PWM2OFL_PWM2OFL7_POSN                    equ 0007h
PWM2OFL_PWM2OFL7_POSITION                equ 0007h
PWM2OFL_PWM2OFL7_SIZE                    equ 0001h
PWM2OFL_PWM2OFL7_LENGTH                  equ 0001h
PWM2OFL_PWM2OFL7_MASK                    equ 0080h
PWM2OFL_PWM2OFL_POSN                     equ 0000h
PWM2OFL_PWM2OFL_POSITION                 equ 0000h
PWM2OFL_PWM2OFL_SIZE                     equ 0008h
PWM2OFL_PWM2OFL_LENGTH                   equ 0008h
PWM2OFL_PWM2OFL_MASK                     equ 00FFh

