GopalSaraf/Practicals/PSDL/include/proc/pic16lf1579.inc
// Register: PWM2OFH
#define PWM2OFH PWM2OFH
PWM2OFH                                  equ 0DA8h
// bitfield definitions
PWM2OFH_OF_POSN                          equ 0000h
PWM2OFH_OF_POSITION                      equ 0000h
PWM2OFH_OF_SIZE                          equ 0008h
PWM2OFH_OF_LENGTH                        equ 0008h
PWM2OFH_OF_MASK                          equ 00FFh
PWM2OFH_PWM2OFH0_POSN                    equ 0000h
PWM2OFH_PWM2OFH0_POSITION                equ 0000h
PWM2OFH_PWM2OFH0_SIZE                    equ 0001h
PWM2OFH_PWM2OFH0_LENGTH                  equ 0001h
PWM2OFH_PWM2OFH0_MASK                    equ 0001h
PWM2OFH_PWM2OFH1_POSN                    equ 0001h
PWM2OFH_PWM2OFH1_POSITION                equ 0001h
PWM2OFH_PWM2OFH1_SIZE                    equ 0001h
PWM2OFH_PWM2OFH1_LENGTH                  equ 0001h
PWM2OFH_PWM2OFH1_MASK                    equ 0002h
PWM2OFH_PWM2OFH2_POSN                    equ 0002h
PWM2OFH_PWM2OFH2_POSITION                equ 0002h
PWM2OFH_PWM2OFH2_SIZE                    equ 0001h
PWM2OFH_PWM2OFH2_LENGTH                  equ 0001h
PWM2OFH_PWM2OFH2_MASK                    equ 0004h
PWM2OFH_PWM2OFH3_POSN                    equ 0003h
PWM2OFH_PWM2OFH3_POSITION                equ 0003h
PWM2OFH_PWM2OFH3_SIZE                    equ 0001h
PWM2OFH_PWM2OFH3_LENGTH                  equ 0001h
PWM2OFH_PWM2OFH3_MASK                    equ 0008h
PWM2OFH_PWM2OFH4_POSN                    equ 0004h
PWM2OFH_PWM2OFH4_POSITION                equ 0004h
PWM2OFH_PWM2OFH4_SIZE                    equ 0001h
PWM2OFH_PWM2OFH4_LENGTH                  equ 0001h
PWM2OFH_PWM2OFH4_MASK                    equ 0010h
PWM2OFH_PWM2OFH5_POSN                    equ 0005h
PWM2OFH_PWM2OFH5_POSITION                equ 0005h
PWM2OFH_PWM2OFH5_SIZE                    equ 0001h
PWM2OFH_PWM2OFH5_LENGTH                  equ 0001h
PWM2OFH_PWM2OFH5_MASK                    equ 0020h
PWM2OFH_PWM2OFH6_POSN                    equ 0006h
PWM2OFH_PWM2OFH6_POSITION                equ 0006h
PWM2OFH_PWM2OFH6_SIZE                    equ 0001h
PWM2OFH_PWM2OFH6_LENGTH                  equ 0001h
PWM2OFH_PWM2OFH6_MASK                    equ 0040h
PWM2OFH_PWM2OFH7_POSN                    equ 0007h
PWM2OFH_PWM2OFH7_POSITION                equ 0007h
PWM2OFH_PWM2OFH7_SIZE                    equ 0001h
PWM2OFH_PWM2OFH7_LENGTH                  equ 0001h
PWM2OFH_PWM2OFH7_MASK                    equ 0080h
PWM2OFH_PWM2OFH_POSN                     equ 0000h
PWM2OFH_PWM2OFH_POSITION                 equ 0000h
PWM2OFH_PWM2OFH_SIZE                     equ 0008h
PWM2OFH_PWM2OFH_LENGTH                   equ 0008h
PWM2OFH_PWM2OFH_MASK                     equ 00FFh

// Register: PWM2TMRL
#define PWM2TMRL PWM2TMRL
PWM2TMRL                                 equ 0DA9h
// bitfield definitions
PWM2TMRL_TMR_POSN                        equ 0000h
PWM2TMRL_TMR_POSITION                    equ 0000h
PWM2TMRL_TMR_SIZE                        equ 0008h
PWM2TMRL_TMR_LENGTH                      equ 0008h
PWM2TMRL_TMR_MASK                        equ 00FFh
PWM2TMRL_PWM2TMRL0_POSN                  equ 0000h
PWM2TMRL_PWM2TMRL0_POSITION              equ 0000h
PWM2TMRL_PWM2TMRL0_SIZE                  equ 0001h
PWM2TMRL_PWM2TMRL0_LENGTH                equ 0001h
PWM2TMRL_PWM2TMRL0_MASK                  equ 0001h
PWM2TMRL_PWM2TMRL1_POSN                  equ 0001h
PWM2TMRL_PWM2TMRL1_POSITION              equ 0001h
PWM2TMRL_PWM2TMRL1_SIZE                  equ 0001h
PWM2TMRL_PWM2TMRL1_LENGTH                equ 0001h
PWM2TMRL_PWM2TMRL1_MASK                  equ 0002h
PWM2TMRL_PWM2TMRL2_POSN                  equ 0002h
PWM2TMRL_PWM2TMRL2_POSITION              equ 0002h
PWM2TMRL_PWM2TMRL2_SIZE                  equ 0001h
PWM2TMRL_PWM2TMRL2_LENGTH                equ 0001h
PWM2TMRL_PWM2TMRL2_MASK                  equ 0004h
PWM2TMRL_PWM2TMRL3_POSN                  equ 0003h
PWM2TMRL_PWM2TMRL3_POSITION              equ 0003h
PWM2TMRL_PWM2TMRL3_SIZE                  equ 0001h
PWM2TMRL_PWM2TMRL3_LENGTH                equ 0001h
PWM2TMRL_PWM2TMRL3_MASK                  equ 0008h
PWM2TMRL_PWM2TMRL4_POSN                  equ 0004h
PWM2TMRL_PWM2TMRL4_POSITION              equ 0004h
PWM2TMRL_PWM2TMRL4_SIZE                  equ 0001h
PWM2TMRL_PWM2TMRL4_LENGTH                equ 0001h
PWM2TMRL_PWM2TMRL4_MASK                  equ 0010h
PWM2TMRL_PWM2TMRL5_POSN                  equ 0005h
PWM2TMRL_PWM2TMRL5_POSITION              equ 0005h
PWM2TMRL_PWM2TMRL5_SIZE                  equ 0001h
PWM2TMRL_PWM2TMRL5_LENGTH                equ 0001h
PWM2TMRL_PWM2TMRL5_MASK                  equ 0020h
PWM2TMRL_PWM2TMRL6_POSN                  equ 0006h
PWM2TMRL_PWM2TMRL6_POSITION              equ 0006h
PWM2TMRL_PWM2TMRL6_SIZE                  equ 0001h
PWM2TMRL_PWM2TMRL6_LENGTH                equ 0001h
PWM2TMRL_PWM2TMRL6_MASK                  equ 0040h
PWM2TMRL_PWM2TMRL7_POSN                  equ 0007h
PWM2TMRL_PWM2TMRL7_POSITION              equ 0007h
PWM2TMRL_PWM2TMRL7_SIZE                  equ 0001h
PWM2TMRL_PWM2TMRL7_LENGTH                equ 0001h
PWM2TMRL_PWM2TMRL7_MASK                  equ 0080h
PWM2TMRL_PWM2TMRL_POSN                   equ 0000h
PWM2TMRL_PWM2TMRL_POSITION               equ 0000h
PWM2TMRL_PWM2TMRL_SIZE                   equ 0008h
PWM2TMRL_PWM2TMRL_LENGTH                 equ 0008h
PWM2TMRL_PWM2TMRL_MASK                   equ 00FFh

// Register: PWM2TMRH
#define PWM2TMRH PWM2TMRH
PWM2TMRH                                 equ 0DAAh
// bitfield definitions
PWM2TMRH_TMR_POSN                        equ 0000h
PWM2TMRH_TMR_POSITION                    equ 0000h
PWM2TMRH_TMR_SIZE                        equ 0008h
PWM2TMRH_TMR_LENGTH                      equ 0008h
PWM2TMRH_TMR_MASK                        equ 00FFh
PWM2TMRH_PWM2TMRH0_POSN                  equ 0000h
PWM2TMRH_PWM2TMRH0_POSITION              equ 0000h
PWM2TMRH_PWM2TMRH0_SIZE                  equ 0001h
PWM2TMRH_PWM2TMRH0_LENGTH                equ 0001h
PWM2TMRH_PWM2TMRH0_MASK                  equ 0001h
PWM2TMRH_PWM2TMRH1_POSN                  equ 0001h
PWM2TMRH_PWM2TMRH1_POSITION              equ 0001h
PWM2TMRH_PWM2TMRH1_SIZE                  equ 0001h
PWM2TMRH_PWM2TMRH1_LENGTH                equ 0001h
PWM2TMRH_PWM2TMRH1_MASK                  equ 0002h
PWM2TMRH_PWM2TMRH2_POSN                  equ 0002h
PWM2TMRH_PWM2TMRH2_POSITION              equ 0002h
PWM2TMRH_PWM2TMRH2_SIZE                  equ 0001h
PWM2TMRH_PWM2TMRH2_LENGTH                equ 0001h
PWM2TMRH_PWM2TMRH2_MASK                  equ 0004h
PWM2TMRH_PWM2TMRH3_POSN                  equ 0003h
PWM2TMRH_PWM2TMRH3_POSITION              equ 0003h
PWM2TMRH_PWM2TMRH3_SIZE                  equ 0001h
PWM2TMRH_PWM2TMRH3_LENGTH                equ 0001h
PWM2TMRH_PWM2TMRH3_MASK                  equ 0008h
PWM2TMRH_PWM2TMRH4_POSN                  equ 0004h
PWM2TMRH_PWM2TMRH4_POSITION              equ 0004h
PWM2TMRH_PWM2TMRH4_SIZE                  equ 0001h
PWM2TMRH_PWM2TMRH4_LENGTH                equ 0001h
PWM2TMRH_PWM2TMRH4_MASK                  equ 0010h
PWM2TMRH_PWM2TMRH5_POSN                  equ 0005h
PWM2TMRH_PWM2TMRH5_POSITION              equ 0005h
PWM2TMRH_PWM2TMRH5_SIZE                  equ 0001h
PWM2TMRH_PWM2TMRH5_LENGTH                equ 0001h
PWM2TMRH_PWM2TMRH5_MASK                  equ 0020h
PWM2TMRH_PWM2TMRH6_POSN                  equ 0006h
PWM2TMRH_PWM2TMRH6_POSITION              equ 0006h
PWM2TMRH_PWM2TMRH6_SIZE                  equ 0001h
PWM2TMRH_PWM2TMRH6_LENGTH                equ 0001h
PWM2TMRH_PWM2TMRH6_MASK                  equ 0040h
PWM2TMRH_PWM2TMRH7_POSN                  equ 0007h
PWM2TMRH_PWM2TMRH7_POSITION              equ 0007h
PWM2TMRH_PWM2TMRH7_SIZE                  equ 0001h
PWM2TMRH_PWM2TMRH7_LENGTH                equ 0001h
PWM2TMRH_PWM2TMRH7_MASK                  equ 0080h
PWM2TMRH_PWM2TMRH_POSN                   equ 0000h
PWM2TMRH_PWM2TMRH_POSITION               equ 0000h
PWM2TMRH_PWM2TMRH_SIZE                   equ 0008h
PWM2TMRH_PWM2TMRH_LENGTH                 equ 0008h
PWM2TMRH_PWM2TMRH_MASK                   equ 00FFh

