GopalSaraf/Practicals/PSDL/include/proc/pic16lf1579.inc
// Register: PWM4CON
#define PWM4CON PWM4CON
PWM4CON                                  equ 0DCBh
// bitfield definitions
PWM4CON_MODE_POSN                        equ 0002h
PWM4CON_MODE_POSITION                    equ 0002h
PWM4CON_MODE_SIZE                        equ 0002h
PWM4CON_MODE_LENGTH                      equ 0002h
PWM4CON_MODE_MASK                        equ 000Ch
PWM4CON_POL_POSN                         equ 0004h
PWM4CON_POL_POSITION                     equ 0004h
PWM4CON_POL_SIZE                         equ 0001h
PWM4CON_POL_LENGTH                       equ 0001h
PWM4CON_POL_MASK                         equ 0010h
PWM4CON_OUT_POSN                         equ 0005h
PWM4CON_OUT_POSITION                     equ 0005h
PWM4CON_OUT_SIZE                         equ 0001h
PWM4CON_OUT_LENGTH                       equ 0001h
PWM4CON_OUT_MASK                         equ 0020h
PWM4CON_OE_POSN                          equ 0006h
PWM4CON_OE_POSITION                      equ 0006h
PWM4CON_OE_SIZE                          equ 0001h
PWM4CON_OE_LENGTH                        equ 0001h
PWM4CON_OE_MASK                          equ 0040h
PWM4CON_EN_POSN                          equ 0007h
PWM4CON_EN_POSITION                      equ 0007h
PWM4CON_EN_SIZE                          equ 0001h
PWM4CON_EN_LENGTH                        equ 0001h
PWM4CON_EN_MASK                          equ 0080h
PWM4CON_PWM4MODE0_POSN                   equ 0002h
PWM4CON_PWM4MODE0_POSITION               equ 0002h
PWM4CON_PWM4MODE0_SIZE                   equ 0001h
PWM4CON_PWM4MODE0_LENGTH                 equ 0001h
PWM4CON_PWM4MODE0_MASK                   equ 0004h
PWM4CON_PWM4MODE1_POSN                   equ 0003h
PWM4CON_PWM4MODE1_POSITION               equ 0003h
PWM4CON_PWM4MODE1_SIZE                   equ 0001h
PWM4CON_PWM4MODE1_LENGTH                 equ 0001h
PWM4CON_PWM4MODE1_MASK                   equ 0008h
PWM4CON_PWM4MODE_POSN                    equ 0002h
PWM4CON_PWM4MODE_POSITION                equ 0002h
PWM4CON_PWM4MODE_SIZE                    equ 0002h
PWM4CON_PWM4MODE_LENGTH                  equ 0002h
PWM4CON_PWM4MODE_MASK                    equ 000Ch
PWM4CON_PWM4POL_POSN                     equ 0004h
PWM4CON_PWM4POL_POSITION                 equ 0004h
PWM4CON_PWM4POL_SIZE                     equ 0001h
PWM4CON_PWM4POL_LENGTH                   equ 0001h
PWM4CON_PWM4POL_MASK                     equ 0010h
PWM4CON_PWM4OUT_POSN                     equ 0005h
PWM4CON_PWM4OUT_POSITION                 equ 0005h
PWM4CON_PWM4OUT_SIZE                     equ 0001h
PWM4CON_PWM4OUT_LENGTH                   equ 0001h
PWM4CON_PWM4OUT_MASK                     equ 0020h
PWM4CON_PWM4OE_POSN                      equ 0006h
PWM4CON_PWM4OE_POSITION                  equ 0006h
PWM4CON_PWM4OE_SIZE                      equ 0001h
PWM4CON_PWM4OE_LENGTH                    equ 0001h
PWM4CON_PWM4OE_MASK                      equ 0040h
PWM4CON_PWM4EN_POSN                      equ 0007h
PWM4CON_PWM4EN_POSITION                  equ 0007h
PWM4CON_PWM4EN_SIZE                      equ 0001h
PWM4CON_PWM4EN_LENGTH                    equ 0001h
PWM4CON_PWM4EN_MASK                      equ 0080h
PWM4CON_MODE0_POSN                       equ 0002h
PWM4CON_MODE0_POSITION                   equ 0002h
PWM4CON_MODE0_SIZE                       equ 0001h
PWM4CON_MODE0_LENGTH                     equ 0001h
PWM4CON_MODE0_MASK                       equ 0004h
PWM4CON_MODE1_POSN                       equ 0003h
PWM4CON_MODE1_POSITION                   equ 0003h
PWM4CON_MODE1_SIZE                       equ 0001h
PWM4CON_MODE1_LENGTH                     equ 0001h
PWM4CON_MODE1_MASK                       equ 0008h

// Register: PWM4INTE
#define PWM4INTE PWM4INTE
PWM4INTE                                 equ 0DCCh
// bitfield definitions
PWM4INTE_PRIE_POSN                       equ 0000h
PWM4INTE_PRIE_POSITION                   equ 0000h
PWM4INTE_PRIE_SIZE                       equ 0001h
PWM4INTE_PRIE_LENGTH                     equ 0001h
PWM4INTE_PRIE_MASK                       equ 0001h
PWM4INTE_DCIE_POSN                       equ 0001h
PWM4INTE_DCIE_POSITION                   equ 0001h
PWM4INTE_DCIE_SIZE                       equ 0001h
PWM4INTE_DCIE_LENGTH                     equ 0001h
PWM4INTE_DCIE_MASK                       equ 0002h
PWM4INTE_PHIE_POSN                       equ 0002h
PWM4INTE_PHIE_POSITION                   equ 0002h
PWM4INTE_PHIE_SIZE                       equ 0001h
PWM4INTE_PHIE_LENGTH                     equ 0001h
PWM4INTE_PHIE_MASK                       equ 0004h
PWM4INTE_OFIE_POSN                       equ 0003h
PWM4INTE_OFIE_POSITION                   equ 0003h
PWM4INTE_OFIE_SIZE                       equ 0001h
PWM4INTE_OFIE_LENGTH                     equ 0001h
PWM4INTE_OFIE_MASK                       equ 0008h
PWM4INTE_PWM4PRIE_POSN                   equ 0000h
PWM4INTE_PWM4PRIE_POSITION               equ 0000h
PWM4INTE_PWM4PRIE_SIZE                   equ 0001h
PWM4INTE_PWM4PRIE_LENGTH                 equ 0001h
PWM4INTE_PWM4PRIE_MASK                   equ 0001h
PWM4INTE_PWM4DCIE_POSN                   equ 0001h
PWM4INTE_PWM4DCIE_POSITION               equ 0001h
PWM4INTE_PWM4DCIE_SIZE                   equ 0001h
PWM4INTE_PWM4DCIE_LENGTH                 equ 0001h
PWM4INTE_PWM4DCIE_MASK                   equ 0002h
PWM4INTE_PWM4PHIE_POSN                   equ 0002h
PWM4INTE_PWM4PHIE_POSITION               equ 0002h
PWM4INTE_PWM4PHIE_SIZE                   equ 0001h
PWM4INTE_PWM4PHIE_LENGTH                 equ 0001h
PWM4INTE_PWM4PHIE_MASK                   equ 0004h
PWM4INTE_PWM4OFIE_POSN                   equ 0003h
PWM4INTE_PWM4OFIE_POSITION               equ 0003h
PWM4INTE_PWM4OFIE_SIZE                   equ 0001h
PWM4INTE_PWM4OFIE_LENGTH                 equ 0001h
PWM4INTE_PWM4OFIE_MASK                   equ 0008h

// Register: PWM4INTF
#define PWM4INTF PWM4INTF
PWM4INTF                                 equ 0DCDh
// bitfield definitions
PWM4INTF_PRIF_POSN                       equ 0000h
PWM4INTF_PRIF_POSITION                   equ 0000h
PWM4INTF_PRIF_SIZE                       equ 0001h
PWM4INTF_PRIF_LENGTH                     equ 0001h
PWM4INTF_PRIF_MASK                       equ 0001h
PWM4INTF_DCIF_POSN                       equ 0001h
PWM4INTF_DCIF_POSITION                   equ 0001h
PWM4INTF_DCIF_SIZE                       equ 0001h
PWM4INTF_DCIF_LENGTH                     equ 0001h
PWM4INTF_DCIF_MASK                       equ 0002h
PWM4INTF_PHIF_POSN                       equ 0002h
PWM4INTF_PHIF_POSITION                   equ 0002h
PWM4INTF_PHIF_SIZE                       equ 0001h
PWM4INTF_PHIF_LENGTH                     equ 0001h
PWM4INTF_PHIF_MASK                       equ 0004h
PWM4INTF_OFIF_POSN                       equ 0003h
PWM4INTF_OFIF_POSITION                   equ 0003h
PWM4INTF_OFIF_SIZE                       equ 0001h
PWM4INTF_OFIF_LENGTH                     equ 0001h
PWM4INTF_OFIF_MASK                       equ 0008h
PWM4INTF_PWM4PRIF_POSN                   equ 0000h
PWM4INTF_PWM4PRIF_POSITION               equ 0000h
PWM4INTF_PWM4PRIF_SIZE                   equ 0001h
PWM4INTF_PWM4PRIF_LENGTH                 equ 0001h
PWM4INTF_PWM4PRIF_MASK                   equ 0001h
PWM4INTF_PWM4DCIF_POSN                   equ 0001h
PWM4INTF_PWM4DCIF_POSITION               equ 0001h
PWM4INTF_PWM4DCIF_SIZE                   equ 0001h
PWM4INTF_PWM4DCIF_LENGTH                 equ 0001h
PWM4INTF_PWM4DCIF_MASK                   equ 0002h
PWM4INTF_PWM4PHIF_POSN                   equ 0002h
PWM4INTF_PWM4PHIF_POSITION               equ 0002h
PWM4INTF_PWM4PHIF_SIZE                   equ 0001h
PWM4INTF_PWM4PHIF_LENGTH                 equ 0001h
PWM4INTF_PWM4PHIF_MASK                   equ 0004h
PWM4INTF_PWM4OFIF_POSN                   equ 0003h
PWM4INTF_PWM4OFIF_POSITION               equ 0003h
PWM4INTF_PWM4OFIF_SIZE                   equ 0001h
PWM4INTF_PWM4OFIF_LENGTH                 equ 0001h
PWM4INTF_PWM4OFIF_MASK                   equ 0008h

