GopalSaraf/Practicals/PSDL/include/proc/pic16lf1579.inc
// Register: CKPPS
#define CKPPS CKPPS
CKPPS                                    equ 0E16h
// bitfield definitions
CKPPS_CKPPS_POSN                         equ 0000h
CKPPS_CKPPS_POSITION                     equ 0000h
CKPPS_CKPPS_SIZE                         equ 0005h
CKPPS_CKPPS_LENGTH                       equ 0005h
CKPPS_CKPPS_MASK                         equ 001Fh
CKPPS_CKPPS0_POSN                        equ 0000h
CKPPS_CKPPS0_POSITION                    equ 0000h
CKPPS_CKPPS0_SIZE                        equ 0001h
CKPPS_CKPPS0_LENGTH                      equ 0001h
CKPPS_CKPPS0_MASK                        equ 0001h
CKPPS_CKPPS1_POSN                        equ 0001h
CKPPS_CKPPS1_POSITION                    equ 0001h
CKPPS_CKPPS1_SIZE                        equ 0001h
CKPPS_CKPPS1_LENGTH                      equ 0001h
CKPPS_CKPPS1_MASK                        equ 0002h
CKPPS_CKPPS2_POSN                        equ 0002h
CKPPS_CKPPS2_POSITION                    equ 0002h
CKPPS_CKPPS2_SIZE                        equ 0001h
CKPPS_CKPPS2_LENGTH                      equ 0001h
CKPPS_CKPPS2_MASK                        equ 0004h
CKPPS_CKPPS3_POSN                        equ 0003h
CKPPS_CKPPS3_POSITION                    equ 0003h
CKPPS_CKPPS3_SIZE                        equ 0001h
CKPPS_CKPPS3_LENGTH                      equ 0001h
CKPPS_CKPPS3_MASK                        equ 0008h
CKPPS_CKPPS4_POSN                        equ 0004h
CKPPS_CKPPS4_POSITION                    equ 0004h
CKPPS_CKPPS4_SIZE                        equ 0001h
CKPPS_CKPPS4_LENGTH                      equ 0001h
CKPPS_CKPPS4_MASK                        equ 0010h

// Register: ADCACTPPS
#define ADCACTPPS ADCACTPPS
ADCACTPPS                                equ 0E17h
// bitfield definitions
ADCACTPPS_ADCACTPPS_POSN                 equ 0000h
ADCACTPPS_ADCACTPPS_POSITION             equ 0000h
ADCACTPPS_ADCACTPPS_SIZE                 equ 0005h
ADCACTPPS_ADCACTPPS_LENGTH               equ 0005h
ADCACTPPS_ADCACTPPS_MASK                 equ 001Fh
ADCACTPPS_ADCACTPPS0_POSN                equ 0000h
ADCACTPPS_ADCACTPPS0_POSITION            equ 0000h
ADCACTPPS_ADCACTPPS0_SIZE                equ 0001h
ADCACTPPS_ADCACTPPS0_LENGTH              equ 0001h
ADCACTPPS_ADCACTPPS0_MASK                equ 0001h
ADCACTPPS_ADCACTPPS1_POSN                equ 0001h
ADCACTPPS_ADCACTPPS1_POSITION            equ 0001h
ADCACTPPS_ADCACTPPS1_SIZE                equ 0001h
ADCACTPPS_ADCACTPPS1_LENGTH              equ 0001h
ADCACTPPS_ADCACTPPS1_MASK                equ 0002h
ADCACTPPS_ADCACTPPS2_POSN                equ 0002h
ADCACTPPS_ADCACTPPS2_POSITION            equ 0002h
ADCACTPPS_ADCACTPPS2_SIZE                equ 0001h
ADCACTPPS_ADCACTPPS2_LENGTH              equ 0001h
ADCACTPPS_ADCACTPPS2_MASK                equ 0004h
ADCACTPPS_ADCACTPPS3_POSN                equ 0003h
ADCACTPPS_ADCACTPPS3_POSITION            equ 0003h
ADCACTPPS_ADCACTPPS3_SIZE                equ 0001h
ADCACTPPS_ADCACTPPS3_LENGTH              equ 0001h
ADCACTPPS_ADCACTPPS3_MASK                equ 0008h
ADCACTPPS_ADCACTPPS4_POSN                equ 0004h
ADCACTPPS_ADCACTPPS4_POSITION            equ 0004h
ADCACTPPS_ADCACTPPS4_SIZE                equ 0001h
ADCACTPPS_ADCACTPPS4_LENGTH              equ 0001h
ADCACTPPS_ADCACTPPS4_MASK                equ 0010h

// Register: RA0PPS
#define RA0PPS RA0PPS
RA0PPS                                   equ 0E90h
// bitfield definitions
RA0PPS_RA0PPS_POSN                       equ 0000h
RA0PPS_RA0PPS_POSITION                   equ 0000h
RA0PPS_RA0PPS_SIZE                       equ 0004h
RA0PPS_RA0PPS_LENGTH                     equ 0004h
RA0PPS_RA0PPS_MASK                       equ 000Fh
RA0PPS_RA0PPS0_POSN                      equ 0000h
RA0PPS_RA0PPS0_POSITION                  equ 0000h
RA0PPS_RA0PPS0_SIZE                      equ 0001h
RA0PPS_RA0PPS0_LENGTH                    equ 0001h
RA0PPS_RA0PPS0_MASK                      equ 0001h
RA0PPS_RA0PPS1_POSN                      equ 0001h
RA0PPS_RA0PPS1_POSITION                  equ 0001h
RA0PPS_RA0PPS1_SIZE                      equ 0001h
RA0PPS_RA0PPS1_LENGTH                    equ 0001h
RA0PPS_RA0PPS1_MASK                      equ 0002h
RA0PPS_RA0PPS2_POSN                      equ 0002h
RA0PPS_RA0PPS2_POSITION                  equ 0002h
RA0PPS_RA0PPS2_SIZE                      equ 0001h
RA0PPS_RA0PPS2_LENGTH                    equ 0001h
RA0PPS_RA0PPS2_MASK                      equ 0004h
RA0PPS_RA0PPS3_POSN                      equ 0003h
RA0PPS_RA0PPS3_POSITION                  equ 0003h
RA0PPS_RA0PPS3_SIZE                      equ 0001h
RA0PPS_RA0PPS3_LENGTH                    equ 0001h
RA0PPS_RA0PPS3_MASK                      equ 0008h

// Register: RA1PPS
#define RA1PPS RA1PPS
RA1PPS                                   equ 0E91h
// bitfield definitions
RA1PPS_RA1PPS_POSN                       equ 0000h
RA1PPS_RA1PPS_POSITION                   equ 0000h
RA1PPS_RA1PPS_SIZE                       equ 0004h
RA1PPS_RA1PPS_LENGTH                     equ 0004h
RA1PPS_RA1PPS_MASK                       equ 000Fh
RA1PPS_RA1PPS0_POSN                      equ 0000h
RA1PPS_RA1PPS0_POSITION                  equ 0000h
RA1PPS_RA1PPS0_SIZE                      equ 0001h
RA1PPS_RA1PPS0_LENGTH                    equ 0001h
RA1PPS_RA1PPS0_MASK                      equ 0001h
RA1PPS_RA1PPS1_POSN                      equ 0001h
RA1PPS_RA1PPS1_POSITION                  equ 0001h
RA1PPS_RA1PPS1_SIZE                      equ 0001h
RA1PPS_RA1PPS1_LENGTH                    equ 0001h
RA1PPS_RA1PPS1_MASK                      equ 0002h
RA1PPS_RA1PPS2_POSN                      equ 0002h
RA1PPS_RA1PPS2_POSITION                  equ 0002h
RA1PPS_RA1PPS2_SIZE                      equ 0001h
RA1PPS_RA1PPS2_LENGTH                    equ 0001h
RA1PPS_RA1PPS2_MASK                      equ 0004h
RA1PPS_RA1PPS3_POSN                      equ 0003h
RA1PPS_RA1PPS3_POSITION                  equ 0003h
RA1PPS_RA1PPS3_SIZE                      equ 0001h
RA1PPS_RA1PPS3_LENGTH                    equ 0001h
RA1PPS_RA1PPS3_MASK                      equ 0008h

// Register: RA2PPS
#define RA2PPS RA2PPS
RA2PPS                                   equ 0E92h
// bitfield definitions
RA2PPS_RA2PPS_POSN                       equ 0000h
RA2PPS_RA2PPS_POSITION                   equ 0000h
RA2PPS_RA2PPS_SIZE                       equ 0004h
RA2PPS_RA2PPS_LENGTH                     equ 0004h
RA2PPS_RA2PPS_MASK                       equ 000Fh
RA2PPS_RA2PPS0_POSN                      equ 0000h
RA2PPS_RA2PPS0_POSITION                  equ 0000h
RA2PPS_RA2PPS0_SIZE                      equ 0001h
RA2PPS_RA2PPS0_LENGTH                    equ 0001h
RA2PPS_RA2PPS0_MASK                      equ 0001h
RA2PPS_RA2PPS1_POSN                      equ 0001h
RA2PPS_RA2PPS1_POSITION                  equ 0001h
RA2PPS_RA2PPS1_SIZE                      equ 0001h
RA2PPS_RA2PPS1_LENGTH                    equ 0001h
RA2PPS_RA2PPS1_MASK                      equ 0002h
RA2PPS_RA2PPS2_POSN                      equ 0002h
RA2PPS_RA2PPS2_POSITION                  equ 0002h
RA2PPS_RA2PPS2_SIZE                      equ 0001h
RA2PPS_RA2PPS2_LENGTH                    equ 0001h
RA2PPS_RA2PPS2_MASK                      equ 0004h
RA2PPS_RA2PPS3_POSN                      equ 0003h
RA2PPS_RA2PPS3_POSITION                  equ 0003h
RA2PPS_RA2PPS3_SIZE                      equ 0001h
RA2PPS_RA2PPS3_LENGTH                    equ 0001h
RA2PPS_RA2PPS3_MASK                      equ 0008h

// Register: RA4PPS
#define RA4PPS RA4PPS
RA4PPS                                   equ 0E94h
// bitfield definitions
RA4PPS_RA4PPS_POSN                       equ 0000h
RA4PPS_RA4PPS_POSITION                   equ 0000h
RA4PPS_RA4PPS_SIZE                       equ 0004h
RA4PPS_RA4PPS_LENGTH                     equ 0004h
RA4PPS_RA4PPS_MASK                       equ 000Fh
RA4PPS_RA4PPS0_POSN                      equ 0000h
RA4PPS_RA4PPS0_POSITION                  equ 0000h
RA4PPS_RA4PPS0_SIZE                      equ 0001h
RA4PPS_RA4PPS0_LENGTH                    equ 0001h
RA4PPS_RA4PPS0_MASK                      equ 0001h
RA4PPS_RA4PPS1_POSN                      equ 0001h
RA4PPS_RA4PPS1_POSITION                  equ 0001h
RA4PPS_RA4PPS1_SIZE                      equ 0001h
RA4PPS_RA4PPS1_LENGTH                    equ 0001h
RA4PPS_RA4PPS1_MASK                      equ 0002h
RA4PPS_RA4PPS2_POSN                      equ 0002h
RA4PPS_RA4PPS2_POSITION                  equ 0002h
RA4PPS_RA4PPS2_SIZE                      equ 0001h
RA4PPS_RA4PPS2_LENGTH                    equ 0001h
RA4PPS_RA4PPS2_MASK                      equ 0004h
RA4PPS_RA4PPS3_POSN                      equ 0003h
RA4PPS_RA4PPS3_POSITION                  equ 0003h
RA4PPS_RA4PPS3_SIZE                      equ 0001h
RA4PPS_RA4PPS3_LENGTH                    equ 0001h
RA4PPS_RA4PPS3_MASK                      equ 0008h

